{
    "unit": 1,
    "sections": [
        {
            "number": 0,
            "topic": "Introduction to Computers and the Internet",
            "notes": [
                "Moore's Law state that every year or two, the capacities of computers have approximately doubled inexpensively. Note that the law is actually an observation.",
                "HTML is a special type of computer language called a markup language designed to specify the content and structure of web pages (also called documents) in a protable manner.",
                "Cascading Style Sheets (CSS) are used to specify the presentation, or styling, of elements on a web page.",
                "CSS3 is the current version of CSS under development.",
                "Javascript helps you build dynamic web pages and computer applications. It enables you to do client-side programming of web applications",
                "Support for HTML5, CSS3 and JavaScript features varies by browser.",
                "jQuery is a JavaScript library that simplifies JavaScript programming by making it easier to amnipulate a web page's elements and interact with servers in a portable manner across various web browsers.",
                "A bit (short for \"binary digit\") is the smallest data item in a computer; it can assume the value 0 or 1.",
                "ARPA proceeded to implement the ARPANET, which eventually evolved into today's Internet.",
                "Each computer on the Internet has a unique IP address. The current IP standard is IPv4",
                "HTTPS is the standard for transferring encrypted data on the web.",
                "URIs (Uniform Resource Identifiers) identify resources on the Internet. URIs that start with http:// are called URLs (Uniform Resource Locators).",
                "A get request typically gets information from a server.",
                "A post request typically posts (or sends) data to a server.",
                "Web-based applications are often multitier applications.",
                "Tim Berners-Lee founded an organization - the World Wide Web Constortium (W3C) - devoted to developing nonproprietary, interoperable technologies for the World Wide Web.",
                "Web 2.0 involves the users - not only do they often create content, but they help organize it, share it, remix it, critique it, update it, etc.",
                "Data items processed by computers form a data hierarchy that becomes larger and more complex in structure as we progress from bits to characters to fields, and so on.",
                "Operating systems provide services that allow each application to execute safely, efficiently, and concurrently with other applications.",
                "Objects, or more precisely the classes objects come from, are essentially reusable software components."
            ]
        },
        {
            "number": 1,
            "topic": "Web Server (Apache and IIS)",
            "notes": [
                "A web server responds to client requests (typically from a web browser) by providing resources such as HTML documents.",
                "URL contains the server's fully qualified hostname. The hostname is then translated into an IP address. The remainder of the URL after the hostname is the resource's location on the web server.",
                "For security reasons the path location is typically a virtual directory",
                "HTTP status code 200 indicates success.",
                "HTTP status code 404 indicates error.",
                "The Multipurpose Internet Mail Extensions (MIME) standard specifies data formats, which programs can use to interpret data correctly.",
                "Browsers often cache recetly viewed web pages so they can quickly reload the pages.",
                "The bottom tier (also called the data tier or the information tier) maintains the application's data.",
                "The middle tier implemenets business logic, controller logic and presentation logic to control interations between the application's clients and its data.",
                "Business logic in the middle tier enforces buisness rules and ensures that data is reliable before the server application updates the database or presents the data to users.",
                "The top tier, or client tier, is the application's user interface.",
                "To request documents from web servers, users must know the hostnames on which the web server software resides.",
                "Local web servers can be accessed through your computer's name or through the name localhost - a hostname that references the local machine and normally translates to the IP address 127.0.0.1.",
                "Apache HTTP Server maintained by the Apache Software Foudnation is currently the most pouplar web server.",
                "MySQL is the most popular open-source database management system.",
                "Microsoft Internet Information Services (IIS) is a web server that is included with several versions of Windows."
            ]
        },
        {
            "number": 2,
            "topic": "Introduction to HTML5",
            "notes": [
                "HTML5 (HyperText Markup Language 5) is a markup language that specifies the structure and content of documents that are displayed in web browsers.",
                "The document type declaration (DOCTYPE) is required in HTML5 documents so that browsers render the page in standards mode.",
                "Comments start with <!-- and end with -->",
                "The head section contains information about the HTML5 document, such as the character set (UTF-8, the most popular character-encoding scheme for the web) that the page use.",
                "The head section also can contain special document-formatting instructions called CSS3 style sheets and client-side programs called scripts for creating dynamic web pages.",
                "The body section contains the page's content, which the browser displays when the user visits the web page.",
                "HTML5 elements and attribute names are case insensitive.",
                "The title element describes the web page.",
                "All text placed between the <p> and </p> tags forms one paragraph.",
                "HTML5 provides six heading elements (h1 through h6) for specifying the relative importance of information.",
                "A hyperlink references or links to other resources, such as HTML5 documents and images.",
                "Attribute href (hypertext reference) specifies a resource's location.",
                "The most popular image formats used by web developers today are PNG (Portable Network Graphics) and JPEG (Joint Photographic Experts Group).",
                "The img element's src attribute specifies an image's location.",
                "HTML5 provides character entity references (in the form &code;) for representing special characters that cannot be rendered otherwise.",
                "A horizontal rule, indicated by the <hr> tag renders a horizontal line with extra space above and below it in most browsers.",
                "Unordered list element ul creates a list in which each item in the list begins with a bullet symbol.",
                "Tables are frequently used to organize data into rows and columns.",
                "A table can be split into three distinc sections, head, body and table foot.",
                "HTML5 provides forms for collecting information from users.",
                "The action attribute of the form element specifies the script to which the form data will be sent.",
                "The submit input element is a button. When the button is pressed, the form's data is sent to the location specified in the form's action attribute.",
                "To link interally to an element with its id attribute set, use the syntax #id.",
                "One way that search engines catalog pages is by reading the meta element's contents."
            ]
        },
        {
            "number": 3,
            "topic": "Introduction to HTML5: Part 2",
            "notes": [
                "The color input type enables the user to enter a color.",
                "The new HTML 5 input types are self validating on the client side, eliminating the need to add complicated JavaScript code to your web pages.",
                "The server should still validate all user input.",
                "The date input type enables the user to enter a date in the form yyyy-mm-dd.",
                "The datetime-local input type enables the user to enter the date and time in a single control.",
                "The email input type enables the user to enter an e-mail address or a list of e-mail address separated by commas.",
                "The month input type enables the user to enter a year and month in the format yyyy-mm, such as 2012-01.",
                "The number input type enables the user to enter a numerical value - mobile browsers typically display a numeric keypad for this input type.",
                "The range input type appears as a slider control in Chrome, Safari, and Opera.",
                "The tel input type enables the user to enter a telephone number.",
                "The time input type enables the user to enter an hour, minute, seconds and fraction of second.",
                "The url input type enables the user to enter a URL.",
                "The week input type enables the user to select a year and week number in the format yyyy-Wnn where nn is 01-53.",
                "The header element creates a header for this page that contains both text and graphics.",
                "The time element enables you to identify a date.",
                "The nav element groups navigation links.",
                "The figure element describes a figure in the document so that it could be moved to the side of the page or to another page.",
                "The article element describes standalone content that could potentially be used or distrubted elsewhere, such as a news article forum post or blog entry.",
                "The section element describes a section of a document, usually with a heading for each section - these element can be nested.",
                "The meter element renders a visual representation of a measure within a range.",
                "The footer element describes a footer - content that usually appears at the bottom of the content or section element."
            ]
        },
        {
            "number": 4,
            "topic": "Introduction to Cascading Style Sheets (CSS): Part 1",
            "notes": [
                "Inline style: declare an individual element's format using the HTML5 attribute style.",
                "color property sets text color.",
                "Embedded style sheets: embed a CSS3 document in an HTML5 document's head section.",
                "style element type attribute specifies the MIME type of the style sheet. Style sheets use text/css.",
                "The style sheet's body declares the CSS rules for the style sheet.",
                "CSS selectors are used to specify the elements that will be styled according to a rule.",
                "Style-class declarations are preceded by a period (.).",
                "font-size property specifies the size used to render the font.",
                "Properties defined for child and descendant elements have a higher specificty than properties defined for parent and ancestor elements.",
                "link element is used to reference an external style sheet from HTML5. The rel attribute declares the linked document to be a stylesheet for the document.",
                "CSS position property allows absolute positioning, which provides greater control over where on a page elements reside.",
                "The z-index property allows a developer to layer overlapping elements.",
                "CSS can control the backgrounds of block-level elements by adding colors and images.",
                "Dimensions of elements on a page can be set with CSS by using properties height and width.",
                "CSS controls the border using three properties: border-width, border-color, and border-style.",
                "Floating allows you to move an element to one side of the screen; other content in the document then flows around the floated element.",
                "The margin property sets the space between the outside of an element's border and all other content on the page.",
                "The padding property determines the distance between the content inside an element and the inside of the element's border.",
                "Media queries allow you to format your content to specific output devices."
            ]
        },
        {
            "number": 5,
            "topic": "Introduction to Cascading Style Sheets (CSS): Part 2",
            "notes": [
                "The CSS3 text-shadow property makes it easy to add a text shadow effect to any text.",
                "The border-radius property allows you to add rounded corners to an element.",
                "RGB or RGBA gives you greater control over the exact colors in your web pages.",
                "CSS3 also allows you to express color using HSL or HSLA.",
                "Lightness - the intensity of light or luminance of the hue - is also expressed as a percentage.",
                "You can shadow any block-level element in CSS3.",
                "Vendor prefixes are used for properties that are still being finalized in the CSS specification but have already been implemented in various browsers.",
                "CSS3 allows you to add multiple background images to an element.",
                "The CSS3 border-image property uses images to place a border around any block-level element.",
                "The animatino property allows you to represent several animation properties in a shorthand notation.",
                "With CSS3 transitions, you can change an element's style over a specified duration.",
                "CSS3 transformations allow you to move, rotate, scale and skew elements.",
                "Using the @font-face rule, you can specify fonts for a web page, even if they're not installed on the user's system.",
                "Flexible Box Layout Module (FBLM) makes it easy to align the contents of boxes, change their size, change their order dynamically, and lay out the contents in any direction.",
                "With CSS# media queries you can determine the finer attributes of the media on which the user is viewing the page, such as the length and width of the viewing area on the screen."
            ]
        }
    ]
}
