{
    "unit": 2,
    "title": "Introduction 2 - Client side Scripting in JavaScript",
    "sections": [
        {
            "number": 1,
            "topic": "Introduction to Scripting",
            "notes": [
                "Often, JavaScript appear in the <head> section of the HTML5 document",
                "The <script> tag indicates to the browser that the text that follows is part of a script.",
                "In HTML5, the default MIME type for a <script> is \"text/html\", so you can omit the type attribute from your <script> tags.",
                "String in JavaScript can be enclosedi n either double quotation marks (\") or single quotation marks (').",
                "The term object normally implies that attributes (data) and behaviours (methods) are associated with the object.",
                "The parentheses following the name of a method contain the arguments that the method requires to perform its task",
                "Every statement should end with a semicolon although none is required by JavaScript",
                "JavaScript is case sensitive.",
                "The document object's writeln method writes a line of HTML5 text in the HTML5 document.",
                "The + operator joins two string together.",
                "Dialogs are useful to display information in windows that \"pop up\" on the screen to grab the user's attention.",
                "When a backslash is encountered in a string of characters, the next character is combined with the backslash to form an escape sequence.",
                "Keywords are words with special meaning in JavaScript.",
                "Keyword var is used to declare the names of variables.",
                "Single line comments begin with // and terminates at the end of the line",
                "Multiline comments begin with delimiter /* and end with delimiter */",
                "null keyword signifies that a variable has no value.",
                "Variable names correspond to locations in the computer's memory.",
                "The basic arithmetic operators are binary operators, because they each operate on two operands.",
                "if statement allows a script to make a decision based on the truth or falsity of a condition.",
                "Date object is used to acquire the current local time."
            ]
        },
        {
            "number": 2,
            "topic": "Control Statements in JavaScript",
            "notes": [
                "A procedure for solving a problem in terms of the actions to be executed, and the order in which the actions are to be executed is called an algorithm.",
                "Pseudocode is an informal language that helps you develop algorithms.",
                "Sequential execution: Execute statements in the order they appear in the code.",
                "JavaScript provides four repetition statemenets, namely, while, do...while, for and for...in.",
                "Conditional operator (?:) is a ternary operator where first operand is a boolean expression, second is a value when expression evaluates to true and third is a value when expression evalutes to false.",
                "A logic error has its effect at execution time.",
                "while statement allows you to specify that an action is to be repeated while some condition remainis true.",
                "JavaSCript represents all numbers as floating-point numbers in memory.",
                "The increment operator, ++ and the decrement operator, --, increment or decrement a variable by 1, respectively.",
                "for statement specifies each of the items needed for counter-controlled repetition with a control variable.",
                "for statement header contains three expressions: initialization, condition, increment expression.",
                "The three expressions in the for statement are optional. The two semicolons in the for statement are required.",
                "JavaScript does not include an exponentiation operator.",
                "switch multiple-selection statement tests variable or expression separately for each of the values it may assume. Different actions are taken for each value.",
                "do...while tests the loop-continuation condition after the loop body executes. The loop body always executes at least once.",
                "break statement in a while, for, do...while or switch statement causes immediate exit from the statement.",
                "Logical operators such as &&, || and ! can be used to form complex conditons by combining simple conditions."
            ]
        },
        {
            "number": 3,
            "topic": "Functions in JavaScript",
            "notes": [
                "return statement passes information from inside a function back to the point in the program where it was called.",
                "A function must be called explicitly for the code in its body to execute.",
                "Reaching the function-ending right brace returns to the point at which a function was invoked.",
                "Executing the statement return; returns to the point at which a function was invoked.",
                "Executing the statement return expression; returns to the point at which a function was invoked.",
                "All variables declared with the keyowrd var in function definitions are local variables.",
                "Each identifier in the program has a scope.",
                "The scope of an identifier for a variable or function is the portion of the program in which the identifier can be referenced.",
                "JavaScript provides nine global functions as part of a Global object.",
                "A recursive function calls itself, either directly, or indirectly through another function.",
                "Iteration terminates when the loop-continuation condition fails while recursion terminates when a base case is recognized."
            ]
        },
        {
            "number": 4,
            "topic": "Arrays, Objects, and Document Object Model (DOM) in JavaScript",
            "notes": [
                "An array is a group of memory locations.",
                "The first element in every array is the zeroth element.",
                "Arrays can be created using a comma-separated initializer list enclosed in square brackets.",
                "Two ways to pass arguments to functions (or methods), pass-by-value or pass-by-reference.",
                "In JavaScript, numbers, boolean values and string are passed to functions by value.",
                "All objects are passed to function by reference.",
                "Two-dimensional array element accessed using an element name of the form a[row][column].",
                "The Document Object Model gives you scripting access to all the elements on the web page.",
                "document object createElement method creates a new DOM node.",
                "document object appendChild inserts a child node after any existing childre of the node on which it's called.",
                "DOM has collections - groups of related objects on a page.",
                "An element's style can be chnaged dynamically in response to user events by changing the object's attribute.",
                "Math object methods enable you to conveniently perform many common mathematical calculations.",
                "Sting object method allows you to perform basic operations on string.",
                "Date object provides methods for date and time manipulations",
                "The Boolean and Number objects are object wrappers for boolean true/false values and numbers, respectively.",
                "document object is provided by the browser and allows JavaScript code to manipulate the current document in the browser.",
                "JSON is a simple way to represent JavaScript objects as strings."
            ]
        },
        {
            "number": 5,
            "topic": "Event Handling in JavaScript",
            "notes": [
                "The window object's load event fires when the window finishes loading successfully.",
                "Every DOM element has a load event.",
                "submit and reset events fire when a form is submitted or reset, respectively.",
                "Event bubbling is the process whereby events fired on child elements \"bubble\" up to their parent elements."
            ]
        },
        {
            "number": 6,
            "topic": "Canvas in HTML5",
            "notes": [
                "The canvas elemetn provides a JavaScript API with methods for drawing two-dimensional bitmapped graphics and animations and etc.",
                "By default, the upper-left corner of a canvas has the coordinates (0, 0).",
                "The canvas element has two attributes - width and height.",
                "A context object represents a 2D rendering surface that provides methods for drawing on a canvas.",
                "fillRect method draws rectangle using the arguments x, y, width and height.",
                "To draw lines and complex shapes in canvas, we use paths.",
                "Arcs are portions of the circumference of a circle.",
                "To draw an arc, you specify the arc's starting angle and ending angle measured in radians.",
                "drawImage method is used to draw an image. An image must be stored in an Image object.",
                "createpattern method can be used to create a pattern on the canvas.",
                "Transformation can be applied to the canvas using translate, scale and rotate method.",
                "fillText method can be used to create text on the canvas.",
                "The globalAlpha attribute is used to change the transparency.",
                "The canvas's state includes its current style and transformations, which are maintained in a stack.",
                "The save method is used to save the context's current state.",
                "The restore method restores the context to its previous state.",
                "Most current browsers also support SVG (Scalable Vector Graphics), which offers a different approach to developing 2D graphics.",
                "Vector graphics are made of scalable geometric primitives such as line segments and arcs."
            ]
        }
    ]
}
